//4) Даны 3 целых числа. Найти количество положительных чисел в исходном
//наборе.

public class HW1_4 {
  public static void main(String[] args){
int a = 50;
        int b = 10;
        int c = 0;
        int aa = 0;
        if (a > 0) {
            aa++;
        } if (b > 0) {
            aa ++;
        } if (c > 0) {
            aa ++;
        }
        System.out.println(aa + " positive values");
    }
 }