//6)Напишите программу вывода всех четных чисел от 2 до 100
//включительно

public class HW2_6 {
    public static void main(String[] args) {
  for (int i=1; i<51; i++) {
            System.out.println(2*i);
        }
     }
}



